{
  "<pad>": 0,
  "<unk>": 1,
  "<bos>": 2,
  "<eos>": 3,
  ".": 4,
  "A": 5,
  "B": 6,
  "D": 7,
  "I": 8,
  "L": 9,
  "M": 10,
  "N": 11,
  "T": 12,
  "a": 13,
  "b": 14,
  "c": 15,
  "d": 16,
  "e": 17,
  "f": 18,
  "g": 19,
  "h": 20,
  "i": 21,
  "k": 22,
  "l": 23,
  "m": 24,
  "n": 25,
  "o": 26,
  "p": 27,
  "q": 28,
  "r": 29,
  "s": 30,
  "t": 31,
  "u": 32,
  "v": 33,
  "w": 34,
  "x": 35,
  "y": 36,
  "z": 37,
  "Ġ": 38,
  "in": 39,
  "an": 40,
  "ar": 41,
  "ing": 42,
  "at": 43,
  "de": 44,
  "ge": 45,
  "le": 46,
  "Ġt": 47,
  "re": 48,
  "Ġc": 49,
  "Ġin": 50,
  "ro": 51,
  "mo": 52,
  "he": 53,
  "Ġo": 54,
  "ti": 55,
  "al": 56,
  "Ġs": 57,
  "Ġp": 58,
  "er": 59,
  "Ġf": 60,
  "ce": 61,
  "Ġre": 62,
  "ch": 63,
  "mode": 64,
  "Ġmode": 65,
  "Ġmodel": 66,
  "Ġl": 67,
  "or": 68,
  "Ġof": 69,
  "as": 70,
  "ab": 71,
  "ss": 72,
  "and": 73,
  "ang": 74,
  "angu": 75,
  "angua": 76,
  "Ġlangua": 77,
  "Ġlanguage": 78,
  "on": 79,
  "Ġthe": 80,
  "Ġar": 81,
  "gen": 82,
  "te": 83,
  "Ġh": 84,
  "able": 85,
  "Ġpro": 86,
  "Ġle": 87,
  "Ġlear": 88,
  "Ġlearn": 89,
  "Ġmodels": 90,
  "om": 91,
  "ate": 92,
  "Ġand": 93,
  "ap": 94,
  "cess": 95,
  "ks": 96,
  "wor": 97,
  "Ġn": 98,
  "Ġne": 99,
  "ts": 100,
  "qu": 101,
  "The": 102,
  "ld": 103,
  "ci": 104,
  "cial": 105,
  "li": 106,
  "ee": 107,
  "ach": 108,
  "Ġlearning": 109,
  "Ġare": 110,
  "is": 111,
  "Ġcap": 112,
  "ral": 113,
  "ural": 114,
  "cessing": 115,
  "Ġe": 116,
  "ers": 117,
  "ut": 118,
  "omp": 119,
  "Ġcomp": 120,
  "Ġto": 121,
  "der": 122,
  "un": 123,
  "st": 124,
  "twor": 125,
  "tworks": 126,
  "Ġnetworks": 127,
  "rom": 128,
  "Ġfrom": 129,
  "arge": 130,
  "ata": 131,
  "Tr": 132,
  "tion": 133,
  "iz": 134,
  "Ġw": 135,
  "pro": 136,
  "Ġsc": 137,
  "Ġde": 138,
  "si": 139,
  "ech": 140,
  "es": 141,
  "ain": 142,
  "aining": 143,
  "fu": 144,
  "ful": 145,
  "ati": 146,
  "ation": 147,
  "eld": 148,
  "ield": 149,
  "Ġfield": 150,
  "Ġarti": 151,
  "fi": 152,
  "ficial": 153,
  "Ġartificial": 154,
  "Ġinte": 155,
  "ligen": 156,
  "lligen": 157,
  "lligence": 158,
  "Ġintelligence": 159,
  "Ġhas": 160,
  "Ġsee": 161,
  "Ġseen": 162,
  "mar": 163,
  "mark": 164,
  "markable": 165,
  "Ġremarkable": 166,
  "ress": 167,
  "gress": 168,
  "Ġprogress": 169,
  "Ġrece": 170,
  "nt": 171,
  "Ġrecent": 172,
  "ye": 173,
  "Ġye": 174,
  "ars": 175,
  "Ġyears": 176,
  "achin": 177,
  "Machin": 178,
  "Machine": 179,
  "com": 180,
  "ecom": 181,
  "becom": 182,
  "becoming": 183,
  "Ġbecoming": 184,
  "Ġinc": 185,
  "ly": 186,
  "reas": 187,
  "Ġincreas": 188,
  "ingly": 189,
  "Ġincreasingly": 190,
  "Ġso": 191,
  "ph": 192,
  "ated": 193,
  "cated": 194,
  "phis": 195,
  "phisti": 196,
  "phisticated": 197,
  "Ġsophisticated": 198,
  "Ġcapable": 199,
  "Nat": 200,
  "Natural": 201,
  "Ġprocessing": 202,
  "ables": 203,
  "Ġen": 204,
  "Ġenables": 205,
  "Ġcomput": 206,
  "Ġcomputers": 207,
  "stand": 208,
  "derstand": 209,
  "understand": 210,
  "Ġunderstand": 211,
  "erate": 212,
  "Ġgen": 213,
  "Ġgenerate": 214,
  "man": 215,
  "uman": 216,
  "Ġhuman": 217,
  "Dee": 218,
  "Deep": 219,
  "Ġcan": 220,
  "Ġcomple": 221,
  "Ġcomplex": 222,
  "att": 223,
  "Ġpatt": 224,
  "ern": 225,
  "Ġpattern": 226,
  "Ġpatterns": 227,
  "Ġlarge": 228,
  "Ġa": 229,
  "unts": 230,
  "Ġamo": 231,
  "Ġamounts": 232,
  "data": 233,
  "Ġdata": 234,
  "orm": 235,
  "ans": 236,
  "ormers": 237,
  "ansf": 238,
  "Transf": 239,
  "Transformers": 240,
  "av": 241,
  "Ġhav": 242,
  "Ġhave": 243,
  "tioniz": 244,
  "ed": 245,
  "vo": 246,
  "vol": 247,
  "Ġrevol": 248,
  "utioniz": 249,
  "utionized": 250,
  "Ġrevolutionized": 251,
  "Ġwa": 252,
  "Ġway": 253,
  "Ġwe": 254,
  "proach": 255,
  "Ġap": 256,
  "Ġapproach": 257,
  "Ġmodeling": 258,
  "asks": 259,
  "Ġtasks": 260,
  "Bu": 261,
  "Bui": 262,
  "lding": 263,
  "Building": 264,
  "AI": 265,
  "ĠAI": 266,
  "ms": 267,
  "tems": 268,
  "stems": 269,
  "Ġsy": 270,
  "Ġsystems": 271,
  "Ġscr": 272,
  "atch": 273,
  "Ġscratch": 274,
  "des": 275,
  "vi": 276,
  "Ġprovi": 277,
  "Ġprovides": 278,
  "ep": 279,
  "Ġdeep": 280,
  "Ġinsi": 281,
  "gh": 282,
  "ghts": 283,
  "Ġinsights": 284,
  "to": 285,
  "Ġinto": 286,
  "Ġthei": 287,
  "Ġtheir": 288,
  "ner": 289,
  "Ġinner": 290,
  "king": 291,
  "Ġwor": 292,
  "kings": 293,
  "Ġworkings": 294,
  "ntion": 295,
  "Ġat": 296,
  "Ġatte": 297,
  "Ġattention": 298,
  "mech": 299,
  "mechan": 300,
  "mechanis": 301,
  "mechanism": 302,
  "Ġmechanism": 303,
  "Ġal": 304,
  "ws": 305,
  "ows": 306,
  "lows": 307,
  "Ġallows": 308,
  "oc": 309,
  "us": 310,
  "ocus": 311,
  "Ġfocus": 312,
  "Ġon": 313,
  "ant": 314,
  "vant": 315,
  "Ġrele": 316,
  "Ġrelevant": 317,
  "Ġpar": 318,
  "Ġparts": 319,
  "put": 320,
  "Ġinput": 321,
  "Large": 322,
  "rate": 323,
  "strate": 324,
  "nstrate": 325,
  "monstrate": 326,
  "Ġdemonstrate": 327,
  "gent": 328,
  "mer": 329,
  "Ġemer": 330,
  "Ġemergent": 331,
  "abi": 332,
  "liti": 333,
  "lities": 334,
  "Ġcapabi": 335,
  "Ġcapabilities": 336,
  "Ġas": 337,
  "Ġthey": 338,
  "Ġsca": 339,
  "Ġscale": 340,
  "Ġu": 341,
  "Ġup": 342,
  "Training": 343,
  "Ġneural": 344,
  "qui": 345,
  "Ġrequi": 346,
  "res": 347,
  "Ġrequires": 348,
  "eful": 349,
  "areful": 350,
  "Ġcareful": 351,
  "onsi": 352,
  "deration": 353,
  "onsideration": 354,
  "Ġconsideration": 355,
  "miz": 356,
  "Ġop": 357,
  "Ġopti": 358,
  "mization": 359,
  "Ġoptimization": 360,
  "echn": 361,
  "Ġtechn": 362,
  "iqu": 363,
  "Ġtechniqu": 364,
  "Ġtechniques": 365,
  "Data": 366,
  "Ġqu": 367,
  "Ġqual": 368,
  "ty": 369,
  "ity": 370,
  "Ġquality": 371,
  "processing": 372,
  "reprocessing": 373,
  "Ġpreprocessing": 374,
  "ucial": 375,
  "rucial": 376,
  "Ġcrucial": 377,
  "Ġfor": 378,
  "ccess": 379,
  "Ġsu": 380,
  "ccessful": 381,
  "Ġsuccessful": 382,
  "raining": 383,
  "Ġtraining": 384
}